const ServicesAPI = {
        companies: [
          {
            id: 0,
            name: 'СК МЕД-АСКЕР',
            img: 'MedAsker_logo',
            tel: '8 (495) 123-45-67'
          },
          {
            id: 1,
            name: 'СК Рандеву',
            img: 'Randevu_logo',
            tel: '8 (499) 123-45-68'
          },
          {
            id: 2,
            name: 'Страх-трах',
            img: 'StrahTrah_logo',
            tel: '8 (812) 123-45-69'
          }
        ],
        servicesList: ['Первичный прием врача-стоматолога терапевта', 'Рентген грудной клетки', 'Денситометрия', 'Рентген верхней и нижней челюстей', 'МРТ грудной клетки', 'МРТ челюсти', 'Полирование челюсти', 'Исследование функции внешнего дыхания', 'Снятие камней с 1 зуба', 'МРТ головного мозга'],
        services: [
          {
            name: 'СК МЕД-АСКЕР',
            inServices: ['Первичный прием врача-стоматолога терапевта', 'Полирование челюсти', 'Снятие камней с 1 зуба', 'Рентген верхней и нижней челюстей', 'МРТ грудной клетки'],
            outServices: ['МРТ челюсти', 'Рентген грудной клетки', 'Исследование функции внешнего дыхания', 'Денситометрия', 'МРТ головного мозга']
          },
          {
            name: 'СК Рандеву',
            inServices: ['Первичный прием врача-стоматолога терапевта', 'Рентген грудной клетки', 'Денситометрия', 'Рентген верхней и нижней челюстей', 'МРТ грудной клетки'],
            outServices: ['МРТ челюсти', 'Полирование челюсти', 'Исследование функции внешнего дыхания', 'Снятие камней с 1 зуба', 'МРТ головного мозга']
          },
          {
            name: 'Страх-трах',
            inServices: ['Первичный прием врача-стоматолога терапевта', 'Рентген грудной клетки', 'Денситометрия', 'Рентген верхней и нижней челюстей', 'МРТ грудной клетки', 'МРТ челюсти', 'Полирование челюсти', 'Исследование функции внешнего дыхания', 'Снятие камней с 1 зуба', 'МРТ головного мозга'],
            outServices: []
          }
        ],
        getCompanies() {
            return this.companies;
        },
        getServices(){
            return this.servicesList;
        },
        checkData(name, array){
          const company = this.services.find(x => x.name === name);
          // let services = [
          // 	inServices: [],
          //   outServices: [],
          //   notFound: []
          // ];
          let services = [
          	[],
            [],
            []
          ];
          for(let i = 0; i < array.length; i++){
             let service = array[i];
             if (company.inServices.indexOf(service) >= 0){
             		services[0].push(service);
             }else if (company.outServices.indexOf(service) >= 0){
              services[1].push(service);
             }else{
              services[2].push(service);
             }
          }
          return services;
        }
    }
      
    export default ServicesAPI;
      